---
kind: method
id: M:Autodesk.Revit.DB.ViewDisplayBackground.Dispose
source: html/1ef5405b-0834-c9a6-d966-9e659192a2d8.htm
---
# Autodesk.Revit.DB.ViewDisplayBackground.Dispose Method

Releases all resources used by the ViewDisplayBackground

## Syntax (C#)
```csharp
public void Dispose()
```